In [1]:
import pandas as pd

In [2]:
data = {'ID':  ['1212', '2342','3286','5681','40481'],
        'Name': ['Maaz Amjad', 'Muhammad Hammad Fahim Siddique','Noman Ashref','Sabur Butt','Ivan Deneiel']
        }

df = pd.DataFrame (data, columns = ['ID','Name'])

In [3]:
df

      ID                            Name
0   1212                      Maaz Amjad
1   2342  Muhammad Hammad Fahim Siddique
2   3286                    Noman Ashref
3   5681                      Sabur Butt
4  40481                    Ivan Deneiel

We can use Pandas’ str.split function to split the column of interest. Here we want to split the column “Name” and we can select the column using chain operation and split the column with expand=True option.

In [19]:
df.Name.str.split(" ",expand=True,)

          0        1      2         3
0      Maaz    Amjad   None      None
1  Muhammad   Hammad  Fahim  Siddique
2     Noman   Ashref   None      None
3     Sabur     Butt   None      None
4      Ivan  Deneiel   None      None

In [22]:
df[['First','Midel','Last','']] = df.Name.str.split(" ",expand=True,)
df

      ID                            Name     First    Midel   Last
0   1212                      Maaz Amjad      Maaz    Amjad   None      None
1   2342  Muhammad Hammad Fahim Siddique  Muhammad   Hammad  Fahim  Siddique
2   3286                    Noman Ashref     Noman   Ashref   None      None
3   5681                      Sabur Butt     Sabur     Butt   None      None
4  40481                    Ivan Deneiel      Ivan  Deneiel   None      None